/// 这是位运算符号 >> 的示例，表示将一个二进制数向右移动指定的位数，类似于十进制数除以2的n次方。
///
/// ```
/// // 相当于 0 / 2^1 = 0。
/// assert_eq!(0 >> 1, 0);
///
/// // 相当于 1 / 2^1 = 0。
/// assert_eq!(1 >> 1, 0);
///
/// // 相当于 2 / 2^1 = 1。
/// assert_eq!(2 >> 1, 1);
///
/// // 相当于 3 / 2^1 = 1。
/// assert_eq!(3 >> 1, 1);
///
/// // 相当于 1 / 2^0 = 1。
/// assert_eq!(1 >> 0, 1);
///
/// // 相当于 1 / 2^1 = 0。
/// assert_eq!(1 >> 1, 0);
///
/// // 相当于 1 / 2^2 = 0。
/// assert_eq!(1 >> 2, 0);
///
/// // 相当于 1 / 2^3 = 0。
/// assert_eq!(1 >> 3, 0);
///
/// // 相当于 1 / 2^4 = 0。
/// assert_eq!(1 >> 4, 0);
/// ```
///
pub fn shr() {}
